; domain
(define (domain rover)
(:requirements :strips :typing)
(:types rover waypoint store camera mode lander objective)

(:predicates (at ?x - rover ?y - waypoint)
             (at_lander ?x - lander ?y - waypoint)
             (can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	     (equipped_for_soil_analysis ?r - rover)
             (equipped_for_rock_analysis ?r - rover)
             (equipped_for_imaging ?r - rover)
             (empty ?s - store)
             (have_rock_analysis ?r - rover ?w - waypoint)
             (have_soil_analysis ?r - rover ?w - waypoint)
             (full ?s - store)
	     (calibrated ?c - camera ?r - rover)
	     (supports ?c - camera ?m - mode)
             (available ?r - rover)
             (visible ?w - waypoint ?p - waypoint)
             (have_image ?r - rover ?o - objective ?m - mode)
             (communicated_soil_data ?w - waypoint)
             (communicated_rock_data ?w - waypoint)
             (communicated_image_data ?o - objective ?m - mode)
	     (at_soil_sample ?w - waypoint)
	     (at_rock_sample ?w - waypoint)
             (visible_from ?o - objective ?w - waypoint)
	     (store_of ?s - store ?r - rover)
	     (calibration_target ?i - camera ?o - objective)
	     (on_board ?i - camera ?r - rover)
	     (channel_free ?l - lander))


(:action navigate
:parameters (?param_1 - rover ?param_2 - waypoint ?param_3 - waypoint)
:precondition (and
		(at ?param_1 ?param_2)
)
:effect (and (at ?param_1 ?param_3) (not (at ?param_1 ?param_2))))

(:action sample_soil
:parameters (?param_1 - rover ?param_2 - store ?param_3 - waypoint)
:precondition (and
		(at ?param_1 ?param_3) (at_soil_sample ?param_3) (empty ?param_2) (equipped_for_soil_analysis ?param_1) (store_of ?param_2 ?param_1)
)
:effect (and (full ?param_2) (have_soil_analysis ?param_1 ?param_3) (not (empty ?param_2)) (not (at_soil_sample ?param_3))))

(:action sample_rock
:parameters (?param_1 - rover ?param_2 - store ?param_3 - waypoint)
:precondition (and
		(at ?param_1 ?param_3) (at_rock_sample ?param_3) (empty ?param_2) (equipped_for_rock_analysis ?param_1) (store_of ?param_2 ?param_1)
)
:effect (and (have_rock_analysis ?param_1 ?param_3) (full ?param_2) (not (empty ?param_2)) (not (at_rock_sample ?param_3))))

(:action drop
:parameters (?param_1 - rover ?param_2 - store)
:precondition (and
		(full ?param_2) (store_of ?param_2 ?param_1)
)
:effect (and (empty ?param_2) (not (full ?param_2))))

(:action calibrate 
:parameters (?param_1 - rover ?param_2 - camera ?param_3 - objective ?param_4 - waypoint) 
:precondition (and
		(at ?param_1 ?param_4) (calibration_target ?param_2 ?param_3) (on_board ?param_2 ?param_1) (visible_from ?param_3 ?param_4)
)
:effect (and (calibrated ?param_2 ?param_1) ))

(:action take_image 
:parameters (?param_1 - rover ?param_2 - waypoint ?param_3 - objective ?param_4 - camera ?param_5 - mode) 
:precondition (and
		(at ?param_1 ?param_2) (calibrated ?param_4 ?param_1) (supports ?param_4 ?param_5) (visible_from ?param_3 ?param_2)
)
:effect (and (have_image ?param_1 ?param_3 ?param_5) (not (calibrated ?param_4 ?param_1))))

(:action communicate_soil_data 
:parameters (?param_1 - rover ?param_2 - lander ?param_3 - waypoint ?param_4 - waypoint ?param_5 - waypoint) 
:precondition (and
		(at ?param_1 ?param_4) (at_lander ?param_2 ?param_5) (have_soil_analysis ?param_1 ?param_3)
)
:effect (and (communicated_soil_data ?param_3) ))

(:action communicate_rock_data 
:parameters (?param_1 - rover ?param_2 - lander ?param_3 - waypoint ?param_4 - waypoint ?param_5 - waypoint) 
:precondition (and
		(at ?param_1 ?param_4) (at_lander ?param_2 ?param_5) (have_rock_analysis ?param_1 ?param_3)
)
:effect (and (communicated_rock_data ?param_3) ))

(:action communicate_image_data 
:parameters (?param_1 - rover ?param_2 - lander ?param_3 - objective ?param_4 - mode ?param_5 - waypoint ?param_6 - waypoint) 
:precondition (and
		(at ?param_1 ?param_5) (at_lander ?param_2 ?param_6) (have_image ?param_1 ?param_3 ?param_4)
)
:effect (and (communicated_image_data ?param_3 ?param_4) ))
)

; problem
(define (problem rover-60)
 (:domain rover)
 (:objects 
    general - lander
    colour high_res low_res - mode
    rover1 rover2 rover3 - rover
    rover1store rover2store rover3store - store
    waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 - waypoint
    camera1 camera2 camera3 - camera
    objective1 objective2 objective3 objective4 objective5 objective6 - objective)
 (:init 
    (at_lander general waypoint7)
    (at rover1 waypoint5)
    (at rover2 waypoint5)
    (at rover3 waypoint6)
    (equipped_for_soil_analysis rover2)
    (equipped_for_soil_analysis rover1)
    (equipped_for_rock_analysis rover1)
    (equipped_for_imaging rover3)
    (equipped_for_imaging rover1)
    (equipped_for_imaging rover2)
    (empty rover1store)
    (empty rover2store)
    (empty rover3store)
    (store_of rover1store rover1)
    (store_of rover2store rover2)
    (store_of rover3store rover3)
    (at_rock_sample waypoint2)
    (at_rock_sample waypoint3)
    (at_rock_sample waypoint4)
    (at_rock_sample waypoint5)
    (at_soil_sample waypoint3)
    (at_soil_sample waypoint4)
    (at_soil_sample waypoint5)
    (visible waypoint7 waypoint1)
    (visible waypoint3 waypoint4)
    (visible waypoint4 waypoint3)
    (visible waypoint3 waypoint1)
    (visible waypoint6 waypoint1)
    (visible waypoint2 waypoint3)
    (visible waypoint1 waypoint7)
    (visible waypoint1 waypoint6)
    (visible waypoint3 waypoint2)
    (visible waypoint2 waypoint5)
    (visible waypoint1 waypoint3)
    (visible waypoint5 waypoint2)
    (visible waypoint4 waypoint5)
    (visible waypoint5 waypoint4)
    (visible waypoint3 waypoint5)
    (visible waypoint5 waypoint3)
    (visible waypoint5 waypoint6)
    (visible waypoint6 waypoint5)
    (visible waypoint3 waypoint6)
    (visible waypoint6 waypoint3)
    (visible waypoint2 waypoint4)
    (visible waypoint4 waypoint2)
    (visible waypoint1 waypoint4)
    (visible waypoint4 waypoint1)
    (visible waypoint1 waypoint5)
    (visible waypoint5 waypoint1)
    (visible waypoint6 waypoint7)
    (visible waypoint7 waypoint6)
    (visible waypoint4 waypoint7)
    (visible waypoint7 waypoint4)
    (visible waypoint4 waypoint6)
    (visible waypoint6 waypoint4)
    (visible waypoint3 waypoint7)
    (visible waypoint7 waypoint3)
    (visible waypoint2 waypoint7)
    (visible waypoint7 waypoint2)
    (visible waypoint5 waypoint7)
    (visible waypoint7 waypoint5)
    (visible waypoint1 waypoint2)
    (visible waypoint2 waypoint1)
    (visible waypoint2 waypoint6)
    (visible waypoint6 waypoint2)
    (can_traverse rover1 waypoint7 waypoint1)
    (can_traverse rover1 waypoint3 waypoint4)
    (can_traverse rover1 waypoint4 waypoint3)
    (can_traverse rover1 waypoint3 waypoint1)
    (can_traverse rover1 waypoint6 waypoint1)
    (can_traverse rover1 waypoint2 waypoint3)
    (can_traverse rover1 waypoint1 waypoint7)
    (can_traverse rover1 waypoint1 waypoint6)
    (can_traverse rover1 waypoint3 waypoint2)
    (can_traverse rover1 waypoint2 waypoint5)
    (can_traverse rover1 waypoint1 waypoint3)
    (can_traverse rover1 waypoint5 waypoint2)
    (can_traverse rover1 waypoint4 waypoint5)
    (can_traverse rover1 waypoint5 waypoint4)
    (can_traverse rover1 waypoint5 waypoint6)
    (can_traverse rover1 waypoint6 waypoint5)
    (can_traverse rover1 waypoint3 waypoint6)
    (can_traverse rover1 waypoint6 waypoint3)
    (can_traverse rover1 waypoint3 waypoint7)
    (can_traverse rover1 waypoint7 waypoint3)
    (can_traverse rover1 waypoint1 waypoint2)
    (can_traverse rover1 waypoint2 waypoint1)
    (can_traverse rover2 waypoint7 waypoint1)
    (can_traverse rover2 waypoint3 waypoint4)
    (can_traverse rover2 waypoint4 waypoint3)
    (can_traverse rover2 waypoint3 waypoint1)
    (can_traverse rover2 waypoint6 waypoint1)
    (can_traverse rover2 waypoint2 waypoint3)
    (can_traverse rover2 waypoint1 waypoint7)
    (can_traverse rover2 waypoint1 waypoint6)
    (can_traverse rover2 waypoint3 waypoint2)
    (can_traverse rover2 waypoint2 waypoint5)
    (can_traverse rover2 waypoint1 waypoint3)
    (can_traverse rover2 waypoint5 waypoint2)
    (can_traverse rover2 waypoint3 waypoint5)
    (can_traverse rover2 waypoint5 waypoint3)
    (can_traverse rover2 waypoint5 waypoint7)
    (can_traverse rover2 waypoint7 waypoint5)
    (can_traverse rover2 waypoint2 waypoint6)
    (can_traverse rover2 waypoint6 waypoint2)
    (can_traverse rover3 waypoint7 waypoint1)
    (can_traverse rover3 waypoint3 waypoint4)
    (can_traverse rover3 waypoint4 waypoint3)
    (can_traverse rover3 waypoint3 waypoint1)
    (can_traverse rover3 waypoint6 waypoint1)
    (can_traverse rover3 waypoint2 waypoint3)
    (can_traverse rover3 waypoint1 waypoint7)
    (can_traverse rover3 waypoint1 waypoint6)
    (can_traverse rover3 waypoint3 waypoint2)
    (can_traverse rover3 waypoint2 waypoint5)
    (can_traverse rover3 waypoint1 waypoint3)
    (can_traverse rover3 waypoint5 waypoint2)
    (can_traverse rover3 waypoint4 waypoint5)
    (can_traverse rover3 waypoint5 waypoint4)
    (can_traverse rover3 waypoint2 waypoint4)
    (can_traverse rover3 waypoint4 waypoint2)
    (can_traverse rover3 waypoint1 waypoint4)
    (can_traverse rover3 waypoint4 waypoint1)
    (can_traverse rover3 waypoint4 waypoint7)
    (can_traverse rover3 waypoint7 waypoint4)
    (can_traverse rover3 waypoint2 waypoint7)
    (can_traverse rover3 waypoint7 waypoint2)
    (calibration_target camera1 objective5)
    (on_board camera1 rover3)
    (supports camera1 colour)
    (supports camera1 high_res)
    (supports camera1 low_res)
    (calibration_target camera2 objective5)
    (on_board camera2 rover3)
    (supports camera2 low_res)
    (supports camera2 high_res)
    (calibration_target camera3 objective3)
    (on_board camera3 rover1)
    (supports camera3 colour)
    (visible_from objective1 waypoint3)
    (visible_from objective1 waypoint2)
    (visible_from objective2 waypoint6)
    (visible_from objective2 waypoint4)
    (visible_from objective2 waypoint7)
    (visible_from objective3 waypoint5)
    (visible_from objective4 waypoint1)
    (visible_from objective4 waypoint2)
    (visible_from objective4 waypoint5)
    (visible_from objective4 waypoint3)
    (visible_from objective5 waypoint2)
    (visible_from objective5 waypoint6)
    (visible_from objective5 waypoint1)
    (visible_from objective6 waypoint1)
    (visible_from objective6 waypoint3)
    (visible_from objective6 waypoint2)
    (visible_from objective6 waypoint6)
    (visible_from objective6 waypoint7)
    (visible_from objective6 waypoint5)
    (visible_from objective6 waypoint4))
 (:goal (and 
(communicated_soil_data waypoint3)
(communicated_soil_data waypoint4)
(communicated_soil_data waypoint5)
(communicated_rock_data waypoint4)
(communicated_rock_data waypoint3)
(communicated_rock_data waypoint5)
(communicated_rock_data waypoint2)
(communicated_image_data objective5 colour)
(communicated_image_data objective3 colour)
(communicated_image_data objective1 low_res)
))
)

; plan
1. (calibrate rover3 camera1 objective5 waypoint6)
   added: (calibrated camera1 rover3)
   goals met: 0 of 10
2. (navigate rover3 waypoint6 waypoint1)
   deleted: (at rover3 waypoint6)
   added: (at rover3 waypoint1)
   goals met: 0 of 10
3. (calibrate rover3 camera2 objective5 waypoint1)
   added: (calibrated camera2 rover3)
   goals met: 0 of 10
4. (take_image rover3 waypoint1 objective5 camera1 colour)
   deleted: (calibrated camera1 rover3)
   added: (have_image rover3 objective5 colour)
   goals met: 0 of 10
5. (navigate rover3 waypoint1 waypoint3)
   deleted: (at rover3 waypoint1)
   added: (at rover3 waypoint3)
   goals met: 0 of 10
6. (take_image rover3 waypoint3 objective1 camera2 low_res)
   deleted: (calibrated camera2 rover3)
   added: (have_image rover3 objective1 low_res)
   goals met: 0 of 10
7. (communicate_image_data rover3 general objective5 colour waypoint3 waypoint7)
   added: (communicated_image_data objective5 colour)
   goals met: 1 of 10
8. (communicate_image_data rover3 general objective1 low_res waypoint3 waypoint7)
   added: (communicated_image_data objective1 low_res)
   goals met: 2 of 10
9. (sample_soil rover2 rover2store waypoint5)
   deleted: (empty rover2store) (at_soil_sample waypoint5)
   added: (full rover2store) (have_soil_analysis rover2 waypoint5)
   goals met: 2 of 10
10. (calibrate rover1 camera3 objective3 waypoint5)
   added: (calibrated camera3 rover1)
   goals met: 2 of 10
11. (take_image rover1 waypoint5 objective3 camera3 colour)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective3 colour)
   goals met: 2 of 10
12. (communicate_image_data rover1 general objective3 colour waypoint5 waypoint7)
   added: (communicated_image_data objective3 colour)
   goals met: 3 of 10
13. (communicate_soil_data rover2 general waypoint5 waypoint5 waypoint7)
   added: (communicated_soil_data waypoint5)
   goals met: 4 of 10
14. (sample_rock rover1 rover1store waypoint5)
   deleted: (empty rover1store) (at_rock_sample waypoint5)
   added: (have_rock_analysis rover1 waypoint5) (full rover1store)
   goals met: 4 of 10
15. (navigate rover1 waypoint5 waypoint2)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint2)
   goals met: 4 of 10
16. (communicate_rock_data rover1 general waypoint5 waypoint2 waypoint7)
   added: (communicated_rock_data waypoint5)
   goals met: 5 of 10
17. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 5 of 10
18. (sample_rock rover1 rover1store waypoint2)
   deleted: (empty rover1store) (at_rock_sample waypoint2)
   added: (have_rock_analysis rover1 waypoint2) (full rover1store)
   goals met: 5 of 10
19. (navigate rover1 waypoint2 waypoint3)
   deleted: (at rover1 waypoint2)
   added: (at rover1 waypoint3)
   goals met: 5 of 10
20. (communicate_rock_data rover1 general waypoint2 waypoint3 waypoint7)
   added: (communicated_rock_data waypoint2)
   goals met: 6 of 10
21. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 6 of 10
22. (sample_rock rover1 rover1store waypoint3)
   deleted: (empty rover1store) (at_rock_sample waypoint3)
   added: (have_rock_analysis rover1 waypoint3) (full rover1store)
   goals met: 6 of 10
23. (communicate_rock_data rover1 general waypoint3 waypoint3 waypoint7)
   added: (communicated_rock_data waypoint3)
   goals met: 7 of 10
24. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 7 of 10
25. (sample_soil rover1 rover1store waypoint3)
   deleted: (empty rover1store) (at_soil_sample waypoint3)
   added: (full rover1store) (have_soil_analysis rover1 waypoint3)
   goals met: 7 of 10
26. (navigate rover1 waypoint3 waypoint4)
   deleted: (at rover1 waypoint3)
   added: (at rover1 waypoint4)
   goals met: 7 of 10
27. (communicate_soil_data rover1 general waypoint3 waypoint4 waypoint7)
   added: (communicated_soil_data waypoint3)
   goals met: 8 of 10
28. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 8 of 10
29. (sample_rock rover1 rover1store waypoint4)
   deleted: (empty rover1store) (at_rock_sample waypoint4)
   added: (have_rock_analysis rover1 waypoint4) (full rover1store)
   goals met: 8 of 10
30. (communicate_rock_data rover1 general waypoint4 waypoint4 waypoint7)
   added: (communicated_rock_data waypoint4)
   goals met: 9 of 10
31. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 9 of 10
32. (sample_soil rover1 rover1store waypoint4)
   deleted: (empty rover1store) (at_soil_sample waypoint4)
   added: (full rover1store) (have_soil_analysis rover1 waypoint4)
   goals met: 9 of 10
33. (communicate_soil_data rover1 general waypoint4 waypoint4 waypoint7)
   added: (communicated_soil_data waypoint4)
   goals met: 10 of 10
